---
kind: type
id: T:Autodesk.Revit.DB.STEPImportOptions
source: html/c461e264-69bf-fc16-7432-df40ef4d1ea3.htm
---
# Autodesk.Revit.DB.STEPImportOptions

The import options used to import STEP format files.

## Syntax (C#)
```csharp
public class STEPImportOptions : BaseImportOptions
```